Revit 2027 API
ParameterTypeId.ViewSolarstudyLightingAzimuthValue Property
 "Lighting azimuth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyLightingAzimuthValue { get; }
Public Shared ReadOnly Property ViewSolarstudyLightingAzimuthValue As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyLightingAzimuthValue {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyLightingAzimuthValue : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace